---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarSystemHookTypeBottomDirn1
source: html/0e3304a9-ea49-8bcd-7e4e-a7453f9d89f2.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarSystemHookTypeBottomDirn1 Property

"Bottom Major Hook Type"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarSystemHookTypeBottomDirn1 { get; }
```